In [1]:
even_list=[i for i in range(1,11) if i%2==0]
even_list

[2, 4, 6, 8, 10]

In [2]:
odd_list=[i for i in range(1,11) if i%2!=0]
odd_list

[1, 3, 5, 7, 9]

In [3]:
l=[1,7,5,4,1,2,5]
d=[]
res=[d.append(i) for i in l if i not in d]
d

[1, 7, 5, 4, 2]

In [5]:
import pandas as pd
df=pd.DataFrame(l,columns=['name'])
df

   name
0     1
1     7
2     5
3     4
4     1
5     2
6     5

In [6]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [8]:
df.drop_duplicates()

   name
0     1
1     7
2     5
3     4
5     2

In [10]:
df.loc[len(df)]=10

In [11]:
df

   name
0     1
1     7
2     5
3     4
4     1
5     2
6     5
7    10

In [12]:
df['id']=[2,3,4,5,6,7,8,9]
df

   name  id
0     1   2
1     7   3
2     5   4
3     4   5
4     1   6
5     2   7
6     5   8
7    10   9

select * from employee inner join deparment on employee.dept_id=deparment.id

select deparment,sum(salary) from employee group by department

In [13]:
d={'name':[1,2,3,46,7,9,10,11],
  'id':[2,4,5,3,6,71,77,10]}
df1=pd.DataFrame(d)
df1

   name  id
0     1   2
1     2   4
2     3   5
3    46   3
4     7   6
5     9  71
6    10  77
7    11  10

In [18]:
df[df.isin(df1)]

   name   id
0   1.0  2.0
1   NaN  NaN
2   NaN  NaN
3   NaN  NaN
4   NaN  6.0
5   NaN  NaN
6   NaN  NaN
7   NaN  NaN

In [19]:
df[df.isin(df1)]

SyntaxError: invalid syntax (1563790991.py, line 1)

In [20]:
df.compare(df1)

   name         id
   self other self other
1   7.0   2.0  3.0   4.0
2   5.0   3.0  4.0   5.0
3   4.0  46.0  5.0   3.0
4   1.0   7.0  NaN   NaN
5   2.0   9.0  7.0  71.0
6   5.0  10.0  8.0  77.0
7  10.0  11.0  9.0  10.0

In [21]:
df['id'].compare(df1['id'])

   self  other
1   3.0    4.0
2   4.0    5.0
3   5.0    3.0
5   7.0   71.0
6   8.0   77.0
7   9.0   10.0

In [23]:
def deco_show(func):
    def wrapper():
        print('before show')
        return func()
    return wrapper

def show():
    print('show')
deco_show(show)